import { Character, CharacterKeyOption } from '~/types'

const characters: {
  [key in CharacterKeyOption]: Character
} = {
  ss: {
    fullName: 'สุธรรม แสงประทุม',
    detail: 'คุณเป็นคนที่เข้มแข็งไม่ต่างจากสุธรรม แสงประทุม ในปี 2519 สุธรรมรับบทบาทผู้นําในฐานะเลขาธิการศูนย์นิสิตฯ ต้องแบกรับภาระหลายอย่าง ที่อาจหมายรวมชีวิตของเพื่อน ๆ หลายคน ต้องเผชิญปัญหามากมายที่ดูเหมือนเกินตัวนิสิตคนหนึ่งอย่างมาก แต่สุธรรมก็กล้าที่จะเข้ามารับหน้าที่ตรงนี้ แล้วก็ทํามันได้ดีเสียด้วย ทั้งหมดนี้ต้องอาศัยความกล้าหาญอย่างมากที่จะต่อสู้กับความอยุติธรรมในสังคมขณะนั้น ในแง่หนึ่ง คุณก็มีความเข้มแข็งเหมือนสุธรรม แสงประทุม คุณส่งต่อความเข้มแข็งในตัวคุณให้คนรอบข้างอยู่เสมอ พร้อมกับเชื่อมั่นในตัวเองอยู่ไม่น้อย คุณรู้ดีว่าคุณเป็นมากกว่าแค่นิสิตคนหนึ่ง และคุณทําาอะไรได้มากกว่านั้น ความเข้มแข็งของสุธรรมเป็นเสี้ยวหนึ่งที่งอกงามในตัวคุณ',
    url: '',
    image: 'https://i.kym-cdn.com/entries/icons/original/000/034/915/vibingcatttt.gif',
  },
  al: {
    fullName: 'อเนก เหล่าธรรมทัศน์',
    detail: 'คุณอาจจะไม่แน่ใจในเส้นทางที่ตัวเองเลือก สับสน ลังเล หรือหมดกําลังใจที่จะเดินต่อ แต่ไม่แน่นะว่า คุณอาจจะแค่กําลังเห็นแก่ตัวขึ้นมาเฉย ๆ ถ้าเป็นแบบนั้นคุณก็เป็นเหมือนอเนก เหล่าธรรมทัศน์ คนที่เคยเดินในเส้นทางเดียวกันนี้แหละ เคยเป็นผู้นํานิสิตนักศึกษา เคยเป็นคนเดือนตุลาฯ ที่ต่อสู้มาตลอด แต่วันหนึ่งหลายสิ่งเปลี่ยนไป เขาทําเพื่อตัวเองมากขึ้น คนคนเดียวกับที่เคยเป็นนิสิตผู้มีอุดมการณ์ เป็นหัวหน้าพรรคฝ่ายซ้ายของจุฬา มาวันนี้กลับไม่เป็นดั่งเดิม ทีนี้ขึ้นกับคุณแล้วแหละ ว่าความยากลําบากในการสู้กับความไม่ถูกต้อง หรือปัจจัยอื่นรายล้อมในชีวิตของคุณ จะทําให้คุณเปลี่ยนไปไหม แล้วคุณจะเป็นเหมือนเขารึเปล่า',
    url: '',
    image: 'https://i.kym-cdn.com/entries/icons/original/000/034/915/vibingcatttt.gif',
  },
  sb: {
    fullName: 'สุรชาติ บําารุงสุข',
    detail: 'คุณเป็นคนที่กล้าหาญ และเลือกที่จะทําในสิ่งที่คุณเชื่อ คุณเป็นคนที่มีความถูกต้องนําทางมาโดยตลอด คุณเป็นเหมือนสุรชาติ บําารุงสุข นิสิตคนหนึ่งซึ่งนําพาความทุกข์ยากของผู้คนในสังคมมาเป็นส่วนหนึ่งของชีวิต และสู้เพื่อพวกเขาเหล่านั้นมาโดยตลอด สุรชาติในขณะที่เป็นนิสิตออกไปใช้ชีวิตนอกห้องเรียนร่วมกับกรรมกรแรงงานเป็นเวลาหลายเดือน สุรชาติเลือกที่จะทํากิจกรรมเหล่านี้กับพี่น้องกรรมกรมากกว่าการเรียนของตัวเอง เพื่อรับรู้ปัญหาของพวกเขาและเข้าช่วยเหลือเสมือนเป็นปัญหาของตน คุณเหมือนสุรชาติตรงที่คุณเลือกจะท้าทายกับความอยุติธรรม และกล้าที่จะเริ่มเปลี่ยนแปลง คุณอาจจะกลัว แต่คุณกลัวน้อยกว่าที่ตัวเองคิด คุณเติบโตมาพร้อมกับความเห็นอกเห็นใจผู้อื่นมากมายเหลือเกิน จิตวิญญาณของสุรชาติ บําารุงสุขเติบโตอยู่ในตัวคุณ',
    url: '',
    image: 'https://i.kym-cdn.com/entries/icons/original/000/034/915/vibingcatttt.gif',
  },
  wa: {
    fullName: 'วิชิตชัย อมรกุล',
    detail: 'คุณเป็นคนที่รักคนอื่นมากกว่าตัวเอง แล้วก็ยังกล้าหาญมาก ในแง่หนึ่งคุณเหมือนวิชิตชัย อมรกุล คนที่ประจําอยู่หน้าสุดเพื่อรักษาความปลอดภัยให้กับเพื่อนร่วมอุดมการณ์คนอื่น วิชิตชัย อมรกุล อยู่ในเหตุการณ์ของวันที่ ๖ ตุลาฯ เขาอาสาเข้าประจําาหน่วยรักษาความปลอดภัย และเขาตายเพราะวิ่งเข้าไปช่วยเพื่อนคนอื่นที่บาดเจ็บ มันไม่สําคัญหรอกนะ ว่าคุณจะต้องสละชีวิตเพื่อผู้อื่นเหมือนอย่างวิชิตชัย มันสําคัญที่ว่า คุณเป็นคนหนึ่งที่พร้อมจะช่วยเหลือผู้อื่นที่ประสบกับความไม่ยุติธรรมอยู่เสมอ คุณเอาพวกเขามาก่อนตัวคุณเอง คุณมักจะคิดว่าชีวิตผู้อื่นสําคัญกว่าชีวิตคุณเอง แต่คุณไม่รู้เลยว่าชีวิตของคุณที่พร้อมจะเสียสละให้ผู้อื่นนั้นสุดแสนจะสําคัญขนาดไหน หากไม่มีคนอย่างคุณและวิชิตชัย อมรกุล สังคมนี้อาจไม่มีวันเข้าใจความรักระหว่างเพื่อนมนุษย์ได้เลย ความรักแห่งวิชิตชัย อมรกุลเบ่งบานอย่างสวยงามในตัวคุณ',
    url: '',
    image: 'https://i.kym-cdn.com/entries/icons/original/000/034/915/vibingcatttt.gif',
  },
  wd: {
    fullName: 'วิภา ดาวมณี',
    detail: 'วิภานั้นเป็นหนึ่งในนิสิตจุฬาฯ ที่ผ่านเหตุการณ์ 6 ตุลาฯ มา หลังจากนั้นเธอหนีเข้าป่าไปเข้าร่วมกับพรรคคอมมิวนิสต์ แต่เมื่อรัฐบาลประกาศนิรโทษกรรม เธอก็ออกมาจากป่าและใช้ชีวิตไปอย่างปกติ แล้วก็พยายามลืมเรื่องราวเหล่านี้ไป แต่สุดท้ายก็ไม่สามารถที่จะลืมความสะเทือนใจในครั้งนั้นได้ และเริ่มผลักดันให้สังคมไทยจดจําเรื่องราว 6 ตุลาฯ เธอเองนี่แหละที่เป็นคนสําาคัญในฐานะที่ทําให้เหตุการณ์ 6 ตุลาฯ ได้มีที่ยืนในสังคมเพิ่มขึ้นทีละน้อย ในแง่หนึ่งคุณก็เหมือนวิภา ที่เรื่องราวร้าย ๆ ของสังคมมันทําลายคุณ แต่คุณแข็งแกร่งมากพอที่จะสู้ต่อ อาจจะต้องใช้เวลารักษาบาดแผลบ้าง ต้องใช้เวลาค้นหาความถูกต้องที่ซ่อนไว้ในใจของคุณบ้าง และเมื่อเจอแล้ว คุณก็ทํามันออกมาได้ดี และยืนหยัดอย่างมั่นคงที่จะทําสิ่งดี ๆ ให้สังคมนี้ต่อไป นี่อาจจะเป็นช่วงเวลาหนึ่งในชีวิตของคุณ ที่กําลังค้นหาว่าความถูกต้องคืออะไรความป่วยไข้ของสังคมมันทําร้ายคุณ แต่คุณจะไม่เป็นไร ความแข็งแกร่งของวิภา ดาวมณีเป็นส่วนหนึ่งของตัวคุณ',
    url: '',
    image: 'https://i.kym-cdn.com/entries/icons/original/000/034/915/vibingcatttt.gif',
  },
  pw: {
    fullName: 'ภูมิธรรม เวชยชัย',
    detail: 'คุณเป็นคนที่มีความคิดริเริ่มเหมือนเขา ภูมิธรรมเป็นคนหนึ่งที่เริ่มต้นก่อตั้งพรรคจุฬาประชาชน ในช่วงปี 2518 เขาเป็นคนหนึ่งที่กล้าจะริเริ่มความเปลี่ยนแปลงใหม่ ๆ ในสังคมที่อาจจะไม่ได้ยอมรับมันมากนัก ภูมิธรรมไม่ได้อยู่ในเหตุการณ์ของวันที่ 6 ตุลาฯ แต่เขาเป็นจุดเริ่มต้นของความเปลี่ยนแปลงในขบวนการนักศึกษาขณะนั้น และเป็นคนหนึ่งที่ทนไม่ได้กับความอยุติธรรมที่เกิดขึ้นจนต้องเข้าป่าแม้ไม่ได้ถูกออกหมายจับ นั่นเองที่คุณเหมือนกับเขา คุณเองก็ทนไม่ได้กับความอยุติธรรมในสังคมขณะนี้เหมือนกัน และความเปลี่ยนแปลงที่จะเกิดขึ้นมันอยู่ในมือของคุณ การริเริ่มสร้างสรรค์สิ่งใหม่ ๆ เหมือนภูมิธรรมมันปรากฏในตัวคุณ และคุณเข้าใจดีว่าคุณสร้างความเปลี่ยนแปลงให้สังคมนี้ได้',
    url: '',
    image: 'https://i.kym-cdn.com/entries/icons/original/000/034/915/vibingcatttt.gif',
  },
  kl: {
    fullName: 'เกรียงกมล เลาหไพโรจน์',
    detail: 'เกรียงกมลเป็นนิสิตจุฬาฯ ที่ร่วมก่อตั้งพรรคจุฬาประชาชนมาเช่นกัน และในปี 2518 เขายังได้รับเลือกให้ดําารงตําาแหน่งเลขาธิการศูนย์นิสิตฯ เกรียงกมลเป็นคนหนึ่งในการประสานความร่วมมือระหว่างมหาวิทยาลัยต่าง ๆ ขณะนั้นจนองค์กรนิสิตนักศึกษาเริ่มแข็งแกร่งขึ้น และสร้างบทบาทใหม่ในการทําหน้าที่เพื่อประชาชนมากขึ้นดังนั้นแล้ว คุณก็เหมือนเกรียงกมลตรงที่คุณเข้าใจภาวะผู้นําาในตัวคุณเป็นอย่างดี และคุณรู้ว่าจะใช้ตําแหน่งหรืออํานาจหน้าที่ที่ได้รับมาเพื่อคนอื่นได้อย่างไร เกรียงกมลอาจนับได้ว่าเป็นคนที่เริ่มต้นในการต่อสู้เพื่อคนอื่น ต่อสู้กับความทุกข์ยากของประชาชน และเป็นแรงสําาคัญของการเปลี่ยนแปลงในจุฬาฯ  คุณเองก็เหมือนกัน คุณอาจจะยังไม่ได้มีส่วนในการเปลี่ยนแปลงนี้มากนักในตอนนี้ แต่ความเป็นผู้นําของเกรียงกมลเป็นส่วนหนึ่งในตัวคุณ และเราหวังว่าคุณจะใช้มันเพื่อเปลี่ยนแปลงสังคมให้ดีขึ้นอยู่เสมอ',
    url: '',
    image: 'https://i.kym-cdn.com/entries/icons/original/000/034/915/vibingcatttt.gif',
  },
  bp: {
    fullName: 'บรรยง พงศ์พาณิชย์',
    detail: 'บรรยงเป็นนิสิตคนหนึ่งที่เรียกตัวเองว่าฝ่ายขวา และเป็นส่วนหนึ่งของคน 6 ตุลาฯ เช่นกัน บรรยงได้รับการเชิญชวนโดยฝ่ายขวาจุฬาฯ ในขณะนั้นให้ลงสมัครสโมสรนิสิตจุฬาฯ ปี 2518 ซึ่งได้รับเลือกตั้งเข้ามาบริหารงานของจุฬาฯ ภายหลังบรรยงออกมายอมรับความจริงของการกระทําในฝ่ายขวาในช่วงเวลาน้้น ในแง่หนึ่งคุณก็เหมือนกับบรรยง คุณอาจจะไม่ได้มีความคิดที่เป็นฝ่ายซ้าย แต่การมีอยู่ของคุณคือสิ่งยืนยันชัดเจนของการอยู่ร่วมระหว่างความแตกต่างทางความคิดอันหลากหลายในสังคม คุณอาจจะเป็นฝ่ายขวาเหมือนบรรยง หรือคุณอาจจะไม่ได้มีแนวคิดการเมืองที่ชัดเจนมากนัก แต่คุณเข้าใจดีว่าเราต้องเคารพและไม่ทําาร้ายใคร และนั่นคือสิ่งที่คุณเป็น',
    url: '',
    image: 'https://i.kym-cdn.com/entries/icons/original/000/034/915/vibingcatttt.gif',
  },
  empty: {
    fullName: 'ตัวของคุณเอง',
    detail: 'คุณแตกต่างไปจากคน ๖ ตุลาฯ คุณอาจจะไม่ได้เหมือนมากพอที่จะเป็นใครสักคน หรือไม่คุณก็มีส่วนของหลาย ๆ คนเติบโตในตัวคุณมากกว่าที่รู้ แต่นั่นไม่ใช่เรื่องแย่ บางทีนี่อาจเป็นความพิเศษที่มีค่าเหลือเกินในตัวของคุณ ทั้งนี้ คุณต้องระลึกไว้เสมอว่า ที่คุณจะใช้ตัวตนที่แตกต่างให้เป็นประโยชน์กับสังคมได้ยังไง และเป็นสิ่งสําคัญเหลือเกินที่คุณจะต้องรับรู้ว่า คุณอยากแตกต่างไปบนเส้นทางแบบไหน คุณอาจจะยังไม่รู้ตัวเองมากพอที่จะตัดสินใจ แต่เราหวังว่าคุณจะเป็นคนหนึ่งที่ช่วยเหลือสังคมนี้ร่วมไปกับพวกเราหลายคน จิตวิญญาณของคุณเติบโตอยู่ในตัวคุณ อย่างเป็นตัวคุณที่สุดเลย',
    url: '', // * must leave this empty becuase
    image: 'https://i.kym-cdn.com/entries/icons/original/000/034/915/vibingcatttt.gif',
  },
}

export default characters
